console.log("Демонстрація роботи на нерозрідженому масиві цілих чисел (без undefined-елементів)");
console.log("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~");

const arr = [ 87, 45, 22, 98, 31, 75, 77, 89, 4, 56,
    62, 10, 33, 99, 29, 8, 59, 21, 12, 88,
    34, 64, 1, 100, 44, 28, 17, 90, 73, 50,
    49, 26, 94, 57, 60, 71, 23, 92, 81, 19,
    11, 30, 95, 55, 35, 48, 63, 38, 20, 74,
    6, 13, 53, 70, 41, 91, 7, 52, 83, 25,
    3, 93, 18, 47, 65, 79, 36, 97, 9, 15,
    67, 96, 5, 72, 32, 37, 78, 27, 82, 2,
    54, 42, 16, 24, 84, 69, 80, 14, 61, 76,
    86, 39, 58, 43, 85, 40, 68, 46, 66, 51];

console.log("Оригінальний масив: ", arr)

// обмін
console.log("Сортування методом обміну");
console.log("-------------------------");
ExchangeSort.ascending(arr.slice()); // Сортування за зростанням
ExchangeSort.descending(arr.slice()); // Сортування за спаданням
console.log("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~")
// мінімальні елементи
console.log("Сортування методом мінімальних елементів");
console.log("----------------------------------------");
SelectionSort.ascending(arr.slice()); // Сортування за зростанням
SelectionSort.descending(arr.slice()); // Сортування за спаданням
console.log("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~");
// вставка
console.log("Сортування методом вставки");
console.log("--------------------------");
InsertionSort.ascending(arr.slice()); // Сортування за зростанням
InsertionSort.descending(arr.slice()); // Сортування за спаданням
console.log("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~");
// Шелла
console.log("Сортування методом Шелла");
console.log("------------------------");
ShellSort.ascending(arr.slice()); // Сортування за зростанням
ShellSort.descending(arr.slice()); // Сортування за спаданням
console.log("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~");
// Хоара(швидке сортування)
console.log("Сортування методом Хоара(швидке сортування)");
console.log("-------------------------------------------");
 QuickSort.ascending(arr.slice()); // Сортування за зростанням
 QuickSort.descending(arr.slice()); // Сортування за спаданням



 console.log(" ");
 console.log(" ");
 console.log(" ");
 console.log("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~");
 console.log("Демонстрація роботи на розрідженому масиві цілих чисел (з undefined-елементами)");
 const arr1 = [87, 45, undefined, 22, 98, 31, 75, 77, undefined, 89, 4, 56,
    62, 10, 33, 99, undefined, 29, 8, 59, 21, undefined, 12, 88,
    34, 64, 1, 100, 44, undefined, 28, 17, 90, undefined, 73, 50,
    49, 26, 94, 57, undefined, 60, 71, 23, 92, undefined, 81, 19,
    11, 30, 95, undefined, 55, 35, 48, 63, undefined, 38, 20, 74,
    6, 13, undefined, 53, 70, 41, 91, 7, undefined, 52, 83, 25,
    3, 93, 18, undefined, 47, 65, 79, 36, 97, undefined, 9, 15,
    67, undefined, 96, 5, 72, 32, 37, 78, undefined, 27, 82, 2,
    54, undefined, 42, 16, 24, undefined, 84, 69, 80, 14, 61, 76,
    86, 39, undefined, 58, 43, 85, 40, 68, undefined, 46, 66, 51];
 console.log("Оригінальний масив: ", arr)

 // обмін
 console.log("Сортування методом обміну");
 console.log("-------------------------");
 ExchangeSort.ascending(arr1.slice()); // Сортування за зростанням
 ExchangeSort.descending(arr1.slice()); // Сортування за спаданням
 console.log("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~")
 // мінімальні елементи
 console.log("Сортування методом мінімальних елементів");
 console.log("----------------------------------------");
 SelectionSort.ascending(arr1.slice()); // Сортування за зростанням
 SelectionSort.descending(arr1.slice()); // Сортування за спаданням
 console.log("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~");
 // вставка
 console.log("Сортування методом вставки");
 console.log("--------------------------");
 InsertionSort.ascending(arr1.slice()); // Сортування за зростанням
 InsertionSort.descending(arr1.slice()); // Сортування за спаданням
 console.log("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~");
 // Шелла
 console.log("Сортування методом Шелла");
 console.log("------------------------");
 ShellSort.ascending(arr1.slice()); // Сортування за зростанням
 ShellSort.descending(arr1.slice()); // Сортування за спаданням
 console.log("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~");
 // Хоара(швидке сортування)
 console.log("Сортування методом Хоара(швидке сортування)");
 console.log("-------------------------------------------");
  QuickSort.ascending(arr1.slice()); // Сортування за зростанням
  QuickSort.descending(arr1.slice()); // Сортування за спаданням
